[
  {
    "meal_id": 1,
    "meal_name": "Paneer Tikka",
    "ingredients": [
      "250g Paneer (Indian cottage cheese), cut into 1-inch cubes",
      "1 cup thick yogurt (hung curd)",
      "1 tbsp ginger-garlic paste",
      "1 tsp turmeric powder",
      "1 tsp Kashmiri red chili powder",
      "1 tsp garam masala",
      "1 tsp chaat masala",
      "1 tbsp lemon juice",
      "1 large onion, cut into 1-inch squares",
      "1 large bell pepper (capsicum), cut into 1-inch squares",
      "Salt to taste",
      "2 tbsp vegetable oil for grilling"
    ],
    "recipe": "1. In a large bowl, whisk the yogurt until smooth. Add ginger-garlic paste, all powdered spices, salt, and lemon juice. Mix well. 2. Add the paneer cubes, onion, and bell pepper to the marinade. Gently toss to coat everything evenly. 3. Cover and refrigerate for at least 1 hour. 4. Thread the marinated paneer and vegetables onto skewers. 5. Preheat a grill or tawa. Cook the skewers, turning occasionally and basting with oil, until all sides are golden brown and charred. 6. Serve hot with mint chutney and lemon wedges."
  },
  {
    "meal_id": 2,
    "meal_name": "Vegetable Samosa",
    "ingredients": [
      "For Dough: 2 cups all-purpose flour, 1/4 cup ghee, 1/2 tsp salt, water",
      "For Filling: 4 medium potatoes (boiled, peeled, mashed), 1 cup green peas (boiled), 1 small onion (finely chopped), 1 tsp ginger paste, 1 tsp cumin seeds, 1 tsp coriander powder, 1/2 tsp turmeric, 1/2 tsp red chili powder, 1/2 tsp garam masala, salt",
      "Oil for deep frying"
    ],
    "recipe": "1. Prepare the dough by mixing flour, salt, and ghee. Add water gradually to knead a firm dough. Cover and rest for 30 minutes. 2. For the filling, heat oil, add cumin seeds. Sauté onion and ginger. Add all powdered spices, then mashed potatoes and peas. Mix well and let it cool. 3. Divide dough into balls. Roll into an oval and cut in half. Form a cone, stuff with filling, and seal the edges. 4. Heat oil in a deep pan and fry samosas on low-medium heat until golden and crisp."
  },
  {
    "meal_id": 3,
    "meal_name": "Onion Bhaji",
    "ingredients": [
      "2 large onions, thinly sliced",
      "1 cup gram flour (besan)",
      "1/4 cup rice flour (for crispiness)",
      "1 tsp red chili powder",
      "1/2 tsp turmeric powder",
      "1 tsp ajwain (carom seeds)",
      "2 tbsp chopped coriander leaves",
      "Salt to taste",
      "Water as needed",
      "Oil for deep frying"
    ],
    "recipe": "1. In a bowl, combine sliced onions, salt, and all spices. Mix and let it rest for 10 minutes for onions to release water. 2. Add gram flour and rice flour. Mix well, adding a little water only if necessary to form a thick batter that coats the onions. 3. Heat oil. Drop spoonfuls of the batter into the hot oil. 4. Fry on medium heat until golden brown and crispy. Serve hot with tamarind chutney."
  },
  {
    "meal_id": 4,
    "meal_name": "Hara Bhara Kebab",
    "ingredients": [
      "1 cup spinach leaves (blanched and chopped)",
      "1 cup green peas (boiled and mashed)",
      "2 medium potatoes (boiled and grated)",
      "1/2 cup breadcrumbs",
      "2 tbsp roasted gram flour",
      "1 inch ginger (grated)",
      "2 green chilies (finely chopped)",
      "1/2 tsp chaat masala",
      "Salt to taste",
      "Oil for shallow frying"
    ],
    "recipe": "1. Squeeze excess water from the spinach. 2. In a bowl, mix spinach, mashed peas, grated potatoes, breadcrumbs, roasted gram flour, ginger, chilies, and spices. 3. Combine to form a firm mixture. Divide and shape into flat, round patties. 4. Heat oil in a pan and shallow fry the kebabs on both sides until crisp and golden brown."
  },
  {
    "meal_id": 5,
    "meal_name": "Gobi Manchurian",
    "ingredients": [
      "1 medium cauliflower, cut into florets",
      "For Batter: 1 cup all-purpose flour, 1/4 cup cornflour, 1 tsp ginger-garlic paste, 1 tsp black pepper, salt",
      "For Sauce: 2 tbsp soy sauce, 1 tbsp chili sauce, 1 tbsp vinegar, 1 tsp chopped ginger, 1 tsp chopped garlic, 1 spring onion (chopped)",
      "Oil for deep frying"
    ],
    "recipe": "1. Blanch cauliflower florets in hot salted water for 5 minutes. Drain. 2. Prepare a thick batter with flour, cornflour, ginger-garlic paste, pepper, and salt. Coat the florets and deep fry until golden and crisp. 3. For the sauce, heat oil in a pan, sauté ginger and garlic. Add soy sauce, chili sauce, and vinegar. 4. Add the fried cauliflower to the sauce and toss to coat. Garnish with spring onions."
  },
  {
    "meal_id": 6,
    "meal_name": "Crispy Corn",
    "ingredients": [
      "2 cups sweet corn kernels, boiled",
      "1/4 cup cornflour",
      "2 tbsp rice flour",
      "1 tsp black pepper",
      "1/2 tsp red chili powder",
      "1 medium onion, finely chopped",
      "1/2 bell pepper, finely chopped",
      "Salt to taste",
      "Oil for deep frying"
    ],
    "recipe": "1. Drain the boiled corn completely. 2. In a bowl, mix cornflour, rice flour, pepper, chili powder, and salt. Add the corn and toss until well-coated. 3. Deep fry the coated corn in hot oil until golden and crispy. Drain on a paper towel. 4. In a separate pan, lightly sauté the chopped onion and bell pepper. 5. Add the crispy corn to the pan, toss well, and serve immediately."
  },
  {
    "meal_id": 7,
    "meal_name": "Dahi Ke Kebab",
    "ingredients": [
      "2 cups hung curd (thick yogurt, water drained)",
      "1/2 cup paneer, grated",
      "1/4 cup roasted gram flour (besan)",
      "1 small onion, finely chopped",
      "1 inch ginger, finely chopped",
      "2 green chilies, finely chopped",
      "2 tbsp chopped coriander",
      "Salt and pepper to taste",
      "Oil for shallow frying"
    ],
    "recipe": "1. In a bowl, gently mix hung curd, grated paneer, roasted gram flour, onion, ginger, green chilies, and coriander. 2. Season with salt and pepper. The mixture should be thick. 3. Lightly grease your palms, take a portion of the mixture, and shape it into a small patty. 4. Heat oil in a non-stick pan and carefully shallow fry the kebabs on low-medium heat until both sides are golden brown."
  },
  {
    "meal_id": 8,
    "meal_name": "Aloo Tikki",
    "ingredients": [
      "4 large potatoes, boiled and mashed",
      "1/4 cup breadcrumbs",
      "2 tbsp cornflour",
      "1 tsp ginger paste",
      "2 green chilies, finely chopped",
      "1 tsp chaat masala",
      "1/2 tsp red chili powder",
      "2 tbsp chopped coriander",
      "Salt to taste",
      "Oil for shallow frying"
    ],
    "recipe": "1. Ensure the mashed potatoes are dry and free of lumps. 2. In a bowl, combine mashed potatoes with breadcrumbs, cornflour, ginger paste, green chilies, all spices, and coriander. 3. Mix well to form a dough. Divide and shape into round, flat patties. 4. Heat oil on a tawa or pan. Shallow fry the tikkis on medium heat, pressing them slightly, until they are crisp and golden brown on both sides."
  },
  {
    "meal_id": 9,
    "meal_name": "Chicken Tikka",
    "ingredients": [
      "500g boneless chicken breast, cut into 1.5-inch cubes",
      "1 cup thick yogurt",
      "1 tbsp ginger-garlic paste",
      "2 tbsp tandoori masala",
      "1 tsp Kashmiri red chili powder",
      "1/2 tsp turmeric powder",
      "1 tbsp lemon juice",
      "Salt to taste",
      "2 tbsp mustard oil"
    ],
    "recipe": "1. In a bowl, mix yogurt, ginger-garlic paste, tandoori masala, chili powder, turmeric, salt, lemon juice, and mustard oil to make a marinade. 2. Add the chicken pieces and mix until they are fully coated. Cover and refrigerate for at least 4 hours, or overnight for best results. 3. Preheat oven to 220°C (425°F). Thread the chicken onto skewers. 4. Place skewers on a baking tray and bake for 15-20 minutes, turning once, until cooked through and charred at the edges."
  },
  {
    "meal_id": 10,
    "meal_name": "Seekh Kebab",
    "ingredients": [
      "500g minced mutton or chicken",
      "1 large onion, finely chopped and squeezed dry",
      "2 tbsp ginger-garlic paste",
      "2 green chilies, minced",
      "1/4 cup chopped coriander",
      "1 tsp garam masala",
      "1 tsp red chili powder",
      "1 tbsp roasted gram flour (as binder)",
      "Salt to taste",
      "Melted butter for basting"
    ],
    "recipe": "1. In a food processor, combine the minced meat, onion, ginger-garlic paste, chilies, coriander, and all spices. Pulse until the mixture is fine and well combined. 2. Transfer to a bowl, add the roasted gram flour, and mix well. Refrigerate for 1 hour. 3. Wet your hands, take a portion of the mixture, and press it around a skewer, shaping it into a long kebab. 4. Grill on a barbecue or in an oven, turning frequently and basting with butter, until cooked through and browned."
  },
  {
    "meal_id": 11,
    "meal_name": "Fish Amritsari",
    "ingredients": [
      "500g firm white fish fillets (like Kingfish or Cod), cut into pieces",
      "For Marinade: 1 tbsp lemon juice, 1 tsp ginger-garlic paste, salt",
      "For Batter: 1 cup gram flour (besan), 2 tbsp rice flour, 1 tsp ajwain (carom seeds), 1 tsp red chili powder, 1/2 tsp turmeric, salt",
      "Water to make batter",
      "Oil for deep frying"
    ],
    "recipe": "1. First, marinate the fish pieces with lemon juice, ginger-garlic paste, and salt for 20 minutes. 2. In a separate bowl, prepare the batter by mixing gram flour, rice flour, ajwain, and all spices. Add water gradually to make a thick, smooth batter. 3. Dip each marinated fish piece into the batter, ensuring it's well-coated. 4. Deep fry in hot oil on medium heat until the fish is cooked through and the batter is golden and crisp."
  },
  {
    "meal_id": 12,
    "meal_name": "Prawn Fry",
    "ingredients": [
      "500g prawns, deveined and cleaned",
      "1 tsp turmeric powder",
      "1 tbsp red chili powder",
      "1 tbsp ginger-garlic paste",
      "1 tbsp lemon juice",
      "1/2 tsp black pepper powder",
      "2 tbsp rice flour (for coating)",
      "Salt to taste",
      "3 tbsp oil for pan-frying"
    ],
    "recipe": "1. Marinate the prawns with turmeric, chili powder, ginger-garlic paste, lemon juice, pepper, and salt. Let it sit for 30 minutes. 2. Lightly coat the marinated prawns with rice flour. 3. Heat oil in a wide pan. Place the prawns in a single layer without overcrowding. 4. Pan-fry on medium-high heat for 2-3 minutes on each side, until they turn pink, curl up, and are cooked through. Do not overcook."
  },
  {
    "meal_id": 13,
    "meal_name": "Mutton Shammi Kebab",
    "ingredients": [
      "500g minced mutton",
      "1/2 cup chana dal (split Bengal gram), soaked for 1 hour",
      "1 onion, roughly chopped",
      "1 inch ginger",
      "4 cloves garlic",
      "4 whole red chilies",
      "1 tsp black peppercorns, 2 cloves, 1 black cardamom",
      "1 egg (as binder)",
      "Salt to taste",
      "Ghee for shallow frying"
    ],
    "recipe": "1. In a pressure cooker, add the minced mutton, soaked chana dal, onion, ginger, garlic, and all whole spices with 1 cup of water. Cook for 15-20 minutes until the meat is tender and the water has evaporated. 2. Cool the mixture and grind it to a fine, smooth paste without adding water. 3. Add the egg and chopped coriander to the paste and mix well. 4. Shape the mixture into round, flat patties. 5. Heat ghee in a pan and shallow fry the kebabs until they are crisp and dark brown on both sides."
  },
  {
    "meal_id": 14,
    "meal_name": "Chicken 65",
    "ingredients": [
      "500g boneless chicken, cut into small pieces",
      "For Marinade: 1 tbsp ginger-garlic paste, 1 tbsp red chili powder, 1/2 tsp turmeric, 1 tbsp lemon juice, 1 egg, 2 tbsp cornflour, 2 tbsp rice flour, salt",
      "For Tempering: 2 tbsp oil, 6-8 curry leaves, 4 green chilies (slit)",
      "Oil for deep frying"
    ],
    "recipe": "1. In a bowl, mix the chicken pieces with all the marinade ingredients to form a thick coating. Let it marinate for at least 30 minutes. 2. Deep fry the marinated chicken pieces in hot oil until they are cooked, red, and crispy. Drain and set aside. 3. In another pan, heat 2 tbsp of oil. Add the curry leaves and green chilies and sauté for a minute. 4. Add the fried chicken pieces to the tempering, toss well, and serve immediately."
  },
  {
    "meal_id": 15,
    "meal_name": "Chilli Chicken",
    "ingredients": [
      "500g boneless chicken, cubed",
      "For Batter: 1 egg, 3 tbsp cornflour, 1 tsp black pepper, salt",
      "For Sauce: 2 tbsp soy sauce, 1 tbsp red chili sauce, 1 tbsp vinegar, 1 tbsp chopped garlic, 1 tbsp chopped ginger",
      "1 large onion, cut into petals",
      "1 large bell pepper, cut into squares",
      "Oil for deep frying"
    ],
    "recipe": "1. Coat the chicken cubes in a batter made of egg, cornflour, pepper, and salt. Deep fry until golden and crisp. 2. In a wok or pan, heat oil and sauté the ginger and garlic. 3. Add the onion petals and bell pepper squares and stir-fry on high heat for 2 minutes. 4. Add the soy sauce, chili sauce, and vinegar. Stir well. 5. Add the fried chicken to the sauce and toss quickly to coat everything. Serve hot."
  },
  {
    "meal_id": 16,
    "meal_name": "Tandoori Chicken",
    "ingredients": [
      "1 whole chicken (about 1 kg), skin removed and cut into quarters",
      "For Marinade: 1 cup yogurt, 2 tbsp ginger-garlic paste, 3 tbsp tandoori masala, 1 tsp red chili powder, 1 tbsp lemon juice, 2 tbsp mustard oil, salt",
      "A few drops of red food coloring (optional)"
    ],
    "recipe": "1. Make deep gashes on the chicken pieces. Apply a mix of lemon juice, chili powder, and salt, and set aside for 30 minutes. 2. Prepare the main marinade by mixing yogurt with all the remaining ingredients. 3. Coat the chicken pieces thoroughly with this marinade, ensuring it gets into the gashes. Refrigerate for at least 6-8 hours. 4. Preheat the oven to 220°C (425°F). Place the chicken on a grill rack and bake for 25-30 minutes, or until cooked through, basting with butter occasionally."
  },
  {
    "meal_id": 17,
    "meal_name": "Dal Makhani",
    "ingredients": [
      "1 cup whole black lentils (sabut urad dal)",
      "1/4 cup kidney beans (rajma)",
      "1 large onion, finely chopped",
      "2 large tomatoes, pureed",
      "2 tbsp ginger-garlic paste",
      "1 tsp red chili powder",
      "2 tbsp butter",
      "1/4 cup heavy cream",
      "Salt to taste"
    ],
    "recipe": "1. Soak lentils and kidney beans overnight. Pressure cook them until very soft and mushy. 2. In a heavy-bottomed pan, heat butter. Sauté the onions until golden brown. Add ginger-garlic paste and cook for a minute. 3. Add the tomato puree, red chili powder, and salt. Cook until the oil separates from the masala. 4. Add the cooked lentils and beans to the pan. Mash them slightly. Add water to adjust consistency and let it simmer on low heat for at least 30 minutes. 5. Stir in the heavy cream just before serving. Garnish with a dollop of butter."
  },
  {
    "meal_id": 18,
    "meal_name": "Palak Paneer",
    "ingredients": [
      "250g paneer, cubed",
      "1 large bunch of spinach (palak), blanched and pureed",
      "1 medium onion, finely chopped",
      "1 large tomato, finely chopped",
      "1 tbsp ginger-garlic paste",
      "1 tsp cumin seeds",
      "1/2 tsp turmeric powder",
      "1 tsp red chili powder",
      "1/2 tsp garam masala",
      "2 tbsp cream",
      "2 tbsp oil or ghee",
      "Salt to taste"
    ],
    "recipe": "1. Heat oil/ghee in a pan. Add cumin seeds. Once they splutter, add the chopped onion and sauté until golden. 2. Add ginger-garlic paste and cook for a minute. Add the chopped tomato and cook until soft. 3. Add turmeric, chili powder, and salt. Cook until the masala releases oil. 4. Add the spinach puree and cook for 5-7 minutes. 5. Add the paneer cubes and garam masala. Simmer for another 5 minutes. 6. Stir in the cream before turning off the heat. Serve hot."
  },
  {
    "meal_id": 19,
    "meal_name": "Chole Bhature",
    "ingredients": [
      "For Chole: 1 cup chickpeas (soaked overnight), 1 onion (chopped), 2 tomatoes (pureed), 1 tbsp ginger-garlic paste, 2 tbsp chole masala, 1 tea bag (for color)",
      "For Bhature: 2 cups all-purpose flour, 1/2 cup yogurt, 1 tsp sugar, 1/2 tsp baking soda, salt, water",
      "Oil for deep frying"
    ],
    "recipe": "1. For Chole: Pressure cook the soaked chickpeas with the tea bag and salt until tender. In a pan, sauté onion, then add ginger-garlic paste and tomato puree. Add chole masala and cook. Finally, add the boiled chickpeas and simmer. 2. For Bhature: Knead a soft dough with flour, yogurt, sugar, baking soda, salt, and water. Let it rest for 2-3 hours. 3. Roll out portions of the dough into ovals and deep fry in hot oil until they puff up and turn golden brown. 4. Serve the hot bhature with the chole."
  },
  {
    "meal_id": 20,
    "meal_name": "Malai Kofta",
    "ingredients": [
      "For Kofta: 200g paneer (grated), 2 large potatoes (boiled, mashed), 2 tbsp cornflour, salt, pepper, chopped nuts (optional)",
      "For Gravy: 2 onions (paste), 1 cup tomato puree, 1/4 cup cashew paste, 2 tbsp cream, 1 tsp ginger-garlic paste, 1/2 tsp turmeric, 1 tsp red chili powder, 1 tsp garam masala",
      "Oil for deep frying"
    ],
    "recipe": "1. For Kofta: Mix grated paneer, mashed potatoes, cornflour, salt, and pepper. Shape into small balls, stuffing with nuts if desired. Deep fry until golden brown. 2. For Gravy: Heat oil, sauté the onion paste until golden. Add ginger-garlic paste, then tomato puree. Add all powdered spices and cook until oil separates. 3. Stir in the cashew paste and cook for a few minutes. Add water for desired consistency and bring to a simmer. 4. Finish the gravy with cream and garam masala. To serve, place the koftas in a bowl and pour the hot gravy over them."
  },
  {
    "meal_id": 21,
    "meal_name": "Aloo Gobi",
    "ingredients": [
      "2 large potatoes, cubed",
      "1 medium cauliflower, cut into florets",
      "1 medium onion, sliced",
      "1 large tomato, chopped",
      "1 tsp cumin seeds",
      "1 tsp ginger paste",
      "1/2 tsp turmeric powder",
      "1 tsp coriander powder",
      "1/2 tsp red chili powder",
      "3 tbsp oil",
      "Salt to taste"
    ],
    "recipe": "1. Heat oil in a pan. Add cumin seeds. When they crackle, add the sliced onions and sauté until translucent. 2. Add ginger paste and cook for a minute. Add the chopped tomatoes, turmeric, coriander powder, chili powder, and salt. Cook until tomatoes are soft. 3. Add the potato cubes and cauliflower florets. Stir well to coat with the masala. 4. Cover and cook on low heat for 15-20 minutes, stirring occasionally, until the vegetables are tender. Garnish with fresh coriander."
  },
  {
    "meal_id": 22,
    "meal_name": "Baingan Bharta",
    "ingredients": [
      "1 large eggplant (baingan)",
      "2 medium onions, finely chopped",
      "2 large tomatoes, finely chopped",
      "1 tbsp ginger-garlic paste",
      "2 green chilies, chopped",
      "1/2 tsp turmeric powder",
      "1 tsp red chili powder",
      "1/2 tsp garam masala",
      "3 tbsp oil",
      "Salt to taste"
    ],
    "recipe": "1. Roast the eggplant directly over a flame or in the oven until the skin is charred and the flesh is soft. Let it cool, then peel the skin and mash the pulp. 2. Heat oil in a pan. Sauté the onions until golden brown. 3. Add the ginger-garlic paste and green chilies. Cook for a minute. 4. Add the chopped tomatoes, turmeric, chili powder, and salt. Cook until the tomatoes are mushy and oil separates. 5. Add the mashed eggplant and mix well. Cook for 10 minutes, stirring frequently. 6. Finish with garam masala and garnish with coriander."
  },
  {
    "meal_id": 23,
    "meal_name": "Bhindi Masala",
    "ingredients": [
      "500g okra (bhindi), trimmed and cut into 1-inch pieces",
      "2 medium onions, thinly sliced",
      "1 large tomato, chopped",
      "1 tsp cumin seeds",
      "1/2 tsp turmeric powder",
      "1 tsp coriander powder",
      "1/2 tsp amchur (dry mango powder)",
      "1/2 tsp red chili powder",
      "3 tbsp oil",
      "Salt to taste"
    ],
    "recipe": "1. Heat oil in a pan and fry the okra pieces until they are cooked and slightly crisp. Remove and set aside. 2. In the same pan, add a little more oil if needed. Add cumin seeds. Once they splutter, add the sliced onions and sauté until golden brown. 3. Add the chopped tomato and cook until soft. 4. Add all the powdered spices (turmeric, coriander, chili, amchur) and salt. Cook for 2 minutes. 5. Add the fried okra back to the pan and mix gently to coat with the masala. Cook for another 5 minutes on low heat."
  },
  {
    "meal_id": 24,
    "meal_name": "Navratan Korma",
    "ingredients": [
      "2 cups mixed vegetables (carrots, peas, beans, cauliflower)",
      "1/2 cup paneer cubes",
      "1/4 cup cashews and raisins",
      "For Gravy: 1 onion (paste), 1/2 cup cashew paste, 1/4 cup yogurt, 1/4 cup cream, 1 tsp ginger-garlic paste, whole spices (bay leaf, cinnamon, cloves), 1/2 tsp garam masala",
      "2 tbsp oil"
    ],
    "recipe": "1. Boil or steam the mixed vegetables until tender. Lightly fry the paneer cubes, cashews, and raisins. 2. Heat oil, add whole spices. Sauté onion paste until golden. Add ginger-garlic paste. 3. Lower the heat, add whisked yogurt and cook until oil separates. 4. Stir in the cashew paste and cook for a few minutes. Add a little water, salt, and bring to a simmer. 5. Add the boiled vegetables, paneer, nuts, and raisins. Simmer for 5 minutes. 6. Finish with cream and garam masala."
  },
  {
    "meal_id": 25,
    "meal_name": "Butter Chicken",
    "ingredients": [
      "500g chicken tikka pieces",
      "For Gravy: 1 kg ripe tomatoes, 50g cashews, 2 tbsp butter, 1 tbsp ginger-garlic paste, 1 tsp Kashmiri red chili powder, 1/2 tsp garam masala, 2 tbsp honey or sugar, 1/2 cup heavy cream, 1 tbsp dried fenugreek leaves (kasuri methi)",
      "Salt to taste"
    ],
    "recipe": "1. Blanch and puree the tomatoes with the cashews to make a smooth paste. 2. Heat butter in a pan. Add ginger-garlic paste and sauté. Add the tomato-cashew puree, red chili powder, and salt. Cook for 15-20 minutes until the gravy thickens. 3. Strain the gravy through a sieve for a silky smooth texture. 4. Return the gravy to the pan. Add the chicken tikka pieces, garam masala, and honey/sugar. Simmer for 10 minutes. 5. Finish with heavy cream and crushed kasuri methi."
  },
  {
    "meal_id": 26,
    "meal_name": "Rogan Josh",
    "ingredients": [
      "500g mutton, cut into pieces",
      "1/2 cup yogurt, whisked",
      "1 large onion, finely chopped",
      "2 tbsp ginger-garlic paste",
      "4 tbsp Kashmiri red chili powder (made into a paste with water)",
      "1 tsp fennel powder (saunf)",
      "1/2 tsp dry ginger powder (sonth)",
      "Whole spices: 2 bay leaves, 4 cloves, 4 green cardamoms, 1 black cardamom, 1-inch cinnamon stick",
      "4 tbsp mustard oil"
    ],
    "recipe": "1. Heat mustard oil until it smokes, then cool slightly. Add whole spices. Sauté the chopped onion until deep golden brown. 2. Add the mutton pieces and brown them on high heat. 3. Add the ginger-garlic paste and cook for a minute. 4. Lower the heat, add the whisked yogurt and stir continuously. Then add the red chili paste, fennel powder, and ginger powder. 5. Add 2 cups of hot water and salt. Bring to a boil, then cover and simmer on low heat for 1-1.5 hours, or until the mutton is tender and the gravy is thick and red."
  },
  {
    "meal_id": 27,
    "meal_name": "Goan Fish Curry",
    "ingredients": [
      "500g firm fish (like pomfret or kingfish)",
      "For Masala Paste: 1 cup grated coconut, 5-6 dried red chilies, 1 tsp coriander seeds, 1/2 tsp turmeric powder, 4-5 peppercorns, small ball of tamarind",
      "1 medium onion, finely chopped",
      "2 tbsp oil",
      "Salt to taste"
    ],
    "recipe": "1. Grind all the masala paste ingredients with a little water to a very smooth paste. 2. Heat oil in a pan. Sauté the onion until translucent. 3. Add the ground masala paste and cook for 5-7 minutes until the raw smell disappears and oil starts to separate. 4. Add 2 cups of water and salt. Bring the curry to a boil. 5. Gently slide in the fish pieces. Simmer for 8-10 minutes, or until the fish is cooked through. Do not over-stir."
  },
  {
    "meal_id": 28,
    "meal_name": "Chicken Korma",
    "ingredients": [
      "500g chicken, on the bone",
      "For Marinade: 1 cup yogurt, 1 tbsp ginger-garlic paste, salt",
      "For Gravy: 2 large onions (thinly sliced and deep-fried until crisp), 1/2 cup cashew paste, 1 tsp red chili powder, 1 tsp coriander powder, 1/2 tsp garam masala",
      "Whole spices: bay leaf, cinnamon, cloves",
      "4 tbsp ghee"
    ],
    "recipe": "1. Marinate the chicken in yogurt, ginger-garlic paste, and salt for at least 1 hour. 2. Crush the fried onions (birista). 3. Heat ghee, add whole spices. Add the marinated chicken and cook on high heat for 5-7 minutes. 4. Add the powdered spices, crushed onions, and cashew paste. Stir well and cook for 5 minutes. 5. Add 1 cup of water, cover, and simmer on low heat for 20-25 minutes, until the chicken is tender and the gravy is creamy. Finish with garam masala."
  },
  {
    "meal_id": 29,
    "meal_name": "Hyderabadi Biryani",
    "ingredients": [
      "500g chicken or mutton",
      "2 cups basmati rice, soaked for 30 mins",
      "For Marinade: 1 cup yogurt, 2 tbsp ginger-garlic paste, 1 tbsp red chili powder, 1 tsp turmeric, 1 cup fried onions (birista), 1/2 cup chopped mint, 1/2 cup chopped coriander, juice of 1 lemon",
      "Whole spices, saffron soaked in milk, ghee"
    ],
    "recipe": "1. Marinate the meat with all the marinade ingredients and let it rest for at least 4 hours. 2. Par-boil the soaked basmati rice with whole spices until it's 70% cooked. Drain. 3. In a heavy-bottomed pot, layer the marinated meat at the bottom. Top it with a layer of the par-boiled rice. 4. Sprinkle the saffron milk, remaining fried onions, mint, and a few spoonfuls of ghee on top. 5. Cover the pot with a tight lid and seal the edges with dough (dum cooking). Cook on low heat for 30-40 minutes. Let it rest before opening."
  },
  {
    "meal_id": 30,
    "meal_name": "Keema Matar",
    "ingredients": [
      "500g minced meat (mutton or chicken)",
      "1 cup green peas",
      "2 large onions, finely chopped",
      "2 large tomatoes, pureed",
      "1 tbsp ginger-garlic paste",
      "1 tsp cumin seeds",
      "1 tsp red chili powder",
      "1 tsp coriander powder",
      "1/2 tsp turmeric powder",
      "1/2 tsp garam masala",
      "3 tbsp oil"
    ],
    "recipe": "1. Heat oil, add cumin seeds. Sauté onions until golden brown. 2. Add ginger-garlic paste and cook for a minute. Add the tomato puree and all powdered spices. Cook until oil separates. 3. Add the minced meat and cook on high heat, breaking up lumps, until it's browned. 4. Add the green peas and 1 cup of water. Season with salt. 5. Cover and simmer for 15-20 minutes (for chicken) or 30-40 minutes (for mutton) until the meat is cooked and the gravy has thickened. Finish with garam masala."
  },
  {
    "meal_id": 31,
    "meal_name": "Chicken Tikka Masala",
    "ingredients": [
      "500g chicken tikka pieces",
      "For Gravy: 2 large onions (chopped), 3 tomatoes (pureed), 1/4 cup cashew paste, 1 tbsp ginger-garlic paste, 1 tsp red chili powder, 1 tsp coriander powder, 1/2 tsp turmeric, 1/2 tsp garam masala, 1/4 cup cream, kasuri methi",
      "3 tbsp oil"
    ],
    "recipe": "1. Heat oil, sauté onions until golden. Add ginger-garlic paste. 2. Add tomato puree and powdered spices. Cook until oil separates. 3. Stir in the cashew paste and cook for a few minutes. 4. Add 1.5 cups of water and bring to a simmer. 5. Add the chicken tikka pieces and cook for 10 minutes. 6. Finish with cream, crushed kasuri methi, and garam masala."
  },
  {
    "meal_id": 32,
    "meal_name": "Laal Maas",
    "ingredients": [
      "500g mutton",
      "1 cup yogurt",
      "10-15 dried red Mathania chilies, soaked and ground to a paste",
      "1 large onion, sliced",
      "1 tbsp garlic paste",
      "4 tbsp mustard oil",
      "Whole spices: cloves, black peppercorns, cinnamon",
      "Salt to taste"
    ],
    "recipe": "1. Heat mustard oil. Add whole spices, then the sliced onion. Fry until deep brown. 2. Add the mutton and brown it. Add garlic paste and cook for a minute. 3. Add the red chili paste and cook for 5 minutes. 4. Whisk the yogurt and add it to the pot, stirring constantly. 5. Add 2 cups of hot water and salt. Cover and cook on low heat for 1.5-2 hours until mutton is very tender and the gravy is fiery red."
  },
  {
    "meal_id": 33,
    "meal_name": "Tandoori Roti",
    "ingredients": [
      "2 cups whole wheat flour (atta)",
      "1/2 tsp salt",
      "1/4 cup yogurt",
      "Warm water to knead"
    ],
    "recipe": "1. In a bowl, mix flour and salt. Add yogurt and mix well. 2. Gradually add warm water to knead a soft, pliable dough. Cover and rest for 30 minutes. 3. Divide the dough into balls. Roll out each ball into a circle. 4. Cook on a hot tawa, then directly on the flame using tongs until it puffs up and gets charred spots. Brush with ghee or butter."
  },
  {
    "meal_id": 34,
    "meal_name": "Butter Naan",
    "ingredients": [
      "2 cups all-purpose flour (maida)",
      "1/2 cup warm milk",
      "1/4 cup yogurt",
      "1 tsp sugar",
      "1/2 tsp baking soda",
      "1 tsp active dry yeast",
      "2 tbsp melted butter, plus more for brushing"
    ],
    "recipe": "1. Activate yeast in warm milk with sugar. 2. In a bowl, mix flour, salt, baking soda. Add the yeast mixture, yogurt, and melted butter. Knead into a soft dough. 3. Cover and let it rise for 2 hours. 4. Punch down the dough, divide into balls. Roll into a teardrop shape. 5. Cook on a hot tawa or in a preheated oven until it puffs up and gets golden spots. Brush generously with butter."
  },
  {
    "meal_id": 35,
    "meal_name": "Garlic Naan",
    "ingredients": [
      "2 cups all-purpose flour",
      "1/2 cup warm milk",
      "1/4 cup yogurt",
      "1 tsp yeast",
      "4-5 cloves garlic, finely minced",
      "2 tbsp chopped coriander",
      "Melted butter for brushing"
    ],
    "recipe": "1. Follow the recipe for Butter Naan to prepare the dough. 2. When rolling out the naan, sprinkle minced garlic and chopped coriander on top and press it in gently. 3. Cook as per the Butter Naan instructions. 4. Brush with more butter (can be garlic-infused butter) before serving."
  },
  {
    "meal_id": 36,
    "meal_name": "Lachha Paratha",
    "ingredients": [
      "2 cups whole wheat flour",
      "Ghee for layering",
      "Salt to taste",
      "Water to knead"
    ],
    "recipe": "1. Knead a soft dough with flour, salt, and water. Rest for 20 minutes. 2. Roll out a dough ball into a very thin circle. Spread ghee all over the surface. 3. Sprinkle some dry flour. Start pleating the circle like a fan. 4. Once pleated, roll it up into a tight spiral. Press it flat. 5. Roll out the spiral into a paratha. Cook on a hot tawa with ghee until both sides are golden brown and the layers are visible."
  },
  {
    "meal_id": 37,
    "meal_name": "Missi Roti",
    "ingredients": [
      "1 cup gram flour (besan)",
      "1 cup whole wheat flour",
      "1 medium onion, finely chopped",
      "1 tsp ajwain (carom seeds)",
      "1/2 tsp turmeric powder",
      "2 tbsp chopped coriander",
      "Ghee for cooking"
    ],
    "recipe": "1. In a bowl, mix both flours with all the other ingredients (except ghee). 2. Add water gradually to knead a firm dough. 3. Divide into balls and roll them out into rotis. 4. Cook on a hot tawa, applying ghee on both sides, until cooked and golden brown."
  },
  {
    "meal_id": 38,
    "meal_name": "Rumali Roti",
    "ingredients": [
      "1 cup all-purpose flour",
      "1 cup whole wheat flour",
      "1/2 cup milk",
      "Salt to taste",
      "Warm water"
    ],
    "recipe": "1. Knead a very soft and elastic dough using both flours, milk, salt, and warm water. Rest for 1 hour. 2. Divide into small balls. Roll them out as thin as possible into large circles. 3. Traditionally cooked on an inverted, hot wok (kadhai). Cook for a minute on each side until done. 4. Fold it like a handkerchief (rumal) while it's still hot."
  },
  {
    "meal_id": 39,
    "meal_name": "Plain Rice",
    "ingredients": [
      "1 cup basmati rice",
      "2 cups water",
      "1/2 tsp salt (optional)"
    ],
    "recipe": "1. Rinse the basmati rice thoroughly until the water runs clear. Soak for 30 minutes. 2. Drain the rice. In a pot, add the rice, water, and salt. 3. Bring to a boil, then reduce the heat to the lowest setting. Cover with a tight lid and cook for 15-20 minutes, or until all the water is absorbed. 4. Fluff with a fork before serving."
  },
  {
    "meal_id": 40,
    "meal_name": "Jeera Rice",
    "ingredients": [
      "1 cup basmati rice, soaked",
      "2 tbsp ghee",
      "1 tsp cumin seeds (jeera)",
      "1 bay leaf",
      "2 cups hot water",
      "Salt to taste"
    ],
    "recipe": "1. Heat ghee in a pot. Add the bay leaf and cumin seeds. Let them sizzle. 2. Add the drained soaked rice and sauté gently for 2 minutes. 3. Pour in the hot water and add salt. 4. Bring to a boil, then cover and simmer on low heat for 15-20 minutes until cooked. Garnish with fresh coriander."
  },
  {
    "meal_id": 41,
    "meal_name": "Veg Pulao",
    "ingredients": [
      "1 cup basmati rice, soaked",
      "1 cup mixed vegetables (carrots, peas, beans)",
      "1 medium onion, thinly sliced",
      "1 tbsp ghee or oil",
      "Whole spices: bay leaf, cinnamon, cloves",
      "1 tsp ginger-garlic paste",
      "2 cups water or vegetable stock"
    ],
    "recipe": "1. Heat ghee, add whole spices. Sauté the sliced onion until golden brown. 2. Add ginger-garlic paste and cook for a minute. 3. Add the mixed vegetables and sauté for 3-4 minutes. 4. Add the drained rice and mix gently. 5. Pour in water or stock, add salt, and bring to a boil. Cover and cook on low heat until rice is done and vegetables are tender."
  },
  {
    "meal_id": 42,
    "meal_name": "Peas Pulao",
    "ingredients": [
      "1 cup basmati rice, soaked",
      "1 cup green peas (fresh or frozen)",
      "1 medium onion, sliced",
      "1 tbsp ghee",
      "1 tsp cumin seeds",
      "Whole spices: bay leaf, cloves",
      "2 cups hot water"
    ],
    "recipe": "1. Heat ghee, add cumin seeds and whole spices. Sauté the onion until golden. 2. Add the green peas and cook for 2 minutes. 3. Add the drained rice and sauté gently. 4. Pour in hot water, add salt, and bring to a boil. Cover and simmer on low heat until the rice is fluffy and cooked."
  },
  {
    "meal_id": 43,
    "meal_name": "Kashmiri Pulao",
    "ingredients": [
      "1 cup basmati rice, soaked",
      "1/4 cup mixed nuts (almonds, cashews)",
      "1/4 cup mixed fruits (pomegranate seeds, apple chunks)",
      "A pinch of saffron soaked in 2 tbsp warm milk",
      "1/2 tsp fennel powder",
      "2 tbsp ghee"
    ],
    "recipe": "1. Cook the basmati rice until it's 90% done. Drain and set aside. 2. Heat ghee in a pan, fry the nuts until golden. Remove and keep aside. 3. In the same ghee, add the cooked rice, saffron milk, fennel powder, and salt. Mix gently. 4. Cook on low heat for 5 minutes. 5. Garnish with the fried nuts and fresh fruits just before serving."
  },
  {
    "meal_id": 44,
    "meal_name": "Lemon Rice",
    "ingredients": [
      "2 cups cooked rice, cooled",
      "Juice of 2 large lemons",
      "For Tempering: 2 tbsp oil, 1 tsp mustard seeds, 1 tsp chana dal, 1 tsp urad dal, 2 tbsp peanuts, 2 dried red chilies, 8-10 curry leaves, 1/2 tsp turmeric powder",
      "A pinch of asafoetida (hing)"
    ],
    "recipe": "1. Heat oil in a pan. Add mustard seeds. When they pop, add chana dal, urad dal, and peanuts. Fry until golden. 2. Add dried red chilies, curry leaves, and asafoetida. Sauté for a few seconds. 3. Add turmeric powder, then turn off the heat. 4. Pour this tempering over the cooked rice. Add salt and lemon juice. 5. Mix everything gently until the rice is evenly yellow. Garnish with coriander."
  },
  {
    "meal_id": 45,
    "meal_name": "Gulab Jamun",
    "ingredients": [
      "1 cup milk powder (khoya powder)",
      "1/4 cup all-purpose flour",
      "A pinch of baking soda",
      "2 tbsp ghee",
      "Milk to knead",
      "For Syrup: 2 cups sugar, 1.5 cups water, 4 green cardamoms, a few saffron strands",
      "Ghee or oil for deep frying"
    ],
    "recipe": "1. For Syrup: Boil sugar and water until the syrup is slightly sticky. Add cardamom and saffron. Keep it warm. 2. For Jamuns: Mix milk powder, flour, and baking soda. Rub in the ghee. Add milk little by little to form a soft, smooth dough. 3. Make small, crack-free balls from the dough. 4. Heat ghee/oil on low heat. Fry the balls, stirring gently, until they are golden brown all over. 5. Immediately drop the fried jamuns into the warm sugar syrup. Let them soak for at least 2 hours."
  },
  {
    "meal_id": 46,
    "meal_name": "Rasmalai",
    "ingredients": [
      "1 litre full-fat milk (to make chena/paneer)",
      "2 tbsp lemon juice",
      "For Sugar Syrup: 1 cup sugar, 4 cups water",
      "For Rabri (sweetened milk): 1 litre full-fat milk, 1/2 cup sugar, a pinch of saffron, chopped pistachios and almonds"
    ],
    "recipe": "1. Make chena by curdling boiling milk with lemon juice. Drain and knead the chena until smooth. Make small, flat discs. 2. Boil sugar and water to make a thin syrup. Cook the chena discs in the boiling syrup for 10-12 minutes until they double in size. 3. For Rabri: Boil 1 litre of milk until it reduces to half. Add sugar, saffron, and nuts. Let it cool. 4. Squeeze the excess syrup from the cooked discs and drop them into the chilled rabri. Refrigerate for a few hours before serving."
  },
  {
    "meal_id": 47,
    "meal_name": "Gajar Ka Halwa",
    "ingredients": [
      "1 kg red carrots, grated",
      "1 litre full-fat milk",
      "1 cup sugar (or to taste)",
      "1/2 cup ghee",
      "1/2 cup khoya (milk solids), crumbled",
      "1/4 cup mixed nuts (almonds, pistachios), chopped"
    ],
    "recipe": "1. In a heavy-bottomed pan, combine the grated carrots and milk. Cook on medium heat, stirring occasionally, until all the milk is absorbed. This will take about 40-50 minutes. 2. Add the ghee and sauté for 10-15 minutes until the carrots are well-cooked and the raw smell is gone. 3. Add the sugar and cook until the moisture from the sugar evaporates and the halwa thickens. 4. Stir in the crumbled khoya and chopped nuts. Cook for another 5 minutes. Serve hot."
  },
  {
    "meal_id": 48,
    "meal_name": "Jalebi with Rabri",
    "ingredients": [
      "For Jalebi: 1 cup all-purpose flour, 1 tbsp gram flour, 1 tsp yeast, warm water",
      "For Syrup: 1 cup sugar, 1/2 cup water, pinch of saffron",
      "Ghee for deep frying",
      "Rabri for serving (see Rasmalai recipe)"
    ],
    "recipe": "1. Prepare a smooth, thick batter with flour, gram flour, yeast, and water. Let it ferment in a warm place for 1-2 hours. 2. Prepare a one-string consistency sugar syrup with sugar, water, and saffron. 3. Heat ghee in a flat pan. Pour the batter into a squeeze bottle or piping bag. Squeeze the batter in circular motions into the hot ghee. 4. Fry until crisp and golden on both sides. 5. Immediately dip the fried jalebis in the warm sugar syrup for 30 seconds. Serve hot with chilled rabri."
  },
  {
    "meal_id": 49,
    "meal_name": "Kulfi",
    "ingredients": [
      "1 litre full-fat milk",
      "1/2 cup sugar",
      "1/4 cup milk powder",
      "1/4 cup chopped pistachios and almonds",
      "1/2 tsp cardamom powder",
      "A pinch of saffron"
    ],
    "recipe": "1. In a heavy-bottomed pan, bring the milk to a boil. Reduce the heat and simmer, stirring frequently, until the milk has reduced to about half its original volume. 2. Add the sugar, milk powder, saffron, and cardamom powder. Stir well until everything is dissolved. 3. Continue to simmer for another 10 minutes until the mixture is thick like condensed milk. 4. Stir in the chopped nuts. Let the mixture cool down completely. 5. Pour into kulfi molds and freeze for at least 8 hours or until set."
  },
  {
    "meal_id": 50,
    "meal_name": "Moong Dal Halwa",
    "ingredients": [
      "1 cup yellow moong dal, soaked for 4 hours",
      "1 cup ghee",
      "1 cup sugar",
      "1 cup milk",
      "1 cup water",
      "1/2 tsp cardamom powder",
      "Chopped nuts for garnish"
    ],
    "recipe": "1. Drain the soaked moong dal and grind it to a coarse paste without adding water. 2. Heat ghee in a heavy-bottomed pan. Add the moong dal paste. 3. Cook on low heat, stirring continuously, for about 25-30 minutes, until the dal is grainy, aromatic, and changes color to golden brown. 4. In a separate pot, heat milk, water, and sugar until the sugar dissolves. 5. Pour the hot milk-sugar mixture into the cooked dal paste carefully. Stir continuously to avoid lumps. 6. Cook until the halwa thickens and starts leaving the sides of the pan. Stir in cardamom powder and nuts."
  },
  {
    "meal_id": 51,
    "meal_name": "Paneer Butter Masala",
    "ingredients": [
      "250g paneer, cubed",
      "For Gravy: 4 large tomatoes, 1 onion, 10-12 cashews, 1 tbsp ginger-garlic paste, 2 tbsp butter, 1 tsp Kashmiri red chili powder, 1/2 tsp garam masala, 1/4 cup cream, 1 tbsp kasuri methi"
    ],
    "recipe": "1. Blanch tomatoes, onion, and cashews. Grind to a smooth paste. 2. Heat butter in a pan. Add ginger-garlic paste. Sauté for a minute. 3. Add the ground paste, chili powder, and salt. Cook until the gravy thickens and releases butter. 4. Add 1 cup of water and bring to a simmer. Add the paneer cubes. 5. Simmer for 5 minutes. Finish with garam masala, cream, and crushed kasuri methi."
  },
  {
    "meal_id": 52,
    "meal_name": "Kadai Paneer",
    "ingredients": [
      "250g paneer, cubed",
      "1 large bell pepper, cubed",
      "1 large onion, cubed",
      "For Kadai Masala: 1 tbsp coriander seeds, 4-5 dried red chilies, 1 tsp cumin seeds, 1 tsp fennel seeds",
      "For Gravy: 2 tomatoes (pureed), 1 onion (chopped), 1 tbsp ginger-garlic paste"
    ],
    "recipe": "1. Dry roast the kadai masala ingredients and grind them into a coarse powder. 2. In a pan, sauté the cubed onion and bell pepper until slightly cooked but still crunchy. Remove and set aside. 3. In the same pan, heat oil. Sauté the chopped onion until golden. Add ginger-garlic paste. 4. Add tomato puree and cook. Add the ground kadai masala and salt. 5. Add the paneer and the sautéed vegetables. Mix well and cook for 5 minutes."
  },
  {
    "meal_id": 53,
    "meal_name": "Matar Paneer",
    "ingredients": [
      "250g paneer, cubed",
      "1 cup green peas",
      "For Gravy: 2 onions (chopped), 2 tomatoes (pureed), 1 tbsp ginger-garlic paste, 1 tsp red chili powder, 1 tsp coriander powder, 1/2 tsp turmeric, 1/2 tsp garam masala"
    ],
    "recipe": "1. Lightly fry the paneer cubes until golden and set aside. 2. Heat oil, sauté onions until golden. Add ginger-garlic paste. 3. Add tomato puree and all powdered spices (except garam masala). Cook until oil separates. 4. Add the green peas and 1.5 cups of water. Bring to a boil and simmer until peas are tender. 5. Add the fried paneer cubes and garam masala. Simmer for another 5 minutes."
  },
  {
    "meal_id": 54,
    "meal_name": "Mushroom Masala",
    "ingredients": [
      "500g button mushrooms, cleaned and halved",
      "1 large onion, finely chopped",
      "2 tomatoes, pureed",
      "1 tbsp ginger-garlic paste",
      "1 tsp cumin seeds",
      "1 tsp red chili powder",
      "1 tsp coriander powder",
      "1/2 tsp turmeric",
      "1/2 tsp garam masala",
      "3 tbsp oil"
    ],
    "recipe": "1. Heat oil, add cumin seeds. Sauté onion until golden brown. 2. Add ginger-garlic paste and cook for a minute. 3. Add tomato puree and powdered spices. Cook until the masala thickens and releases oil. 4. Add the mushrooms and mix well to coat with the masala. 5. Cover and cook for 10-15 minutes, stirring occasionally, until mushrooms are cooked and have released their water. 6. Uncover and cook for a few more minutes until the gravy reaches the desired consistency. Finish with garam masala."
  },
  {
    "meal_id": 55,
    "meal_name": "Veg Jalfrezi",
    "ingredients": [
      "2 cups mixed vegetables, cut into batons (carrots, beans, bell peppers, cauliflower)",
      "1 large onion, sliced",
      "1 large tomato, pureed",
      "1 tbsp ginger-garlic paste",
      "1 tbsp tomato ketchup",
      "1 tsp vinegar",
      "1 tsp red chili powder",
      "1/2 tsp turmeric"
    ],
    "recipe": "1. Blanch the vegetables (except bell peppers) until they are tender-crisp. 2. Heat oil in a pan. Sauté the sliced onion and bell peppers on high heat for 2 minutes. 3. Add ginger-garlic paste. Add tomato puree, ketchup, vinegar, and all powdered spices. Cook for 3-4 minutes. 4. Add the blanched vegetables and stir-fry on high heat for 5 minutes, ensuring the vegetables are coated in the sauce but remain crunchy."
  },
  {
    "meal_id": 56,
    "meal_name": "Dal Tadka",
    "ingredients": [
      "1 cup toor dal (arhar dal), washed and soaked",
      "1/2 tsp turmeric powder",
      "Salt to taste",
      "For Tadka (Tempering): 2 tbsp ghee, 1 tsp cumin seeds, 2 dried red chilies, 1 small onion (chopped), 1 tsp chopped garlic, a pinch of asafoetida (hing)"
    ],
    "recipe": "1. Pressure cook the soaked dal with turmeric, salt, and 3 cups of water until soft and mushy. 2. For the tadka, heat ghee in a small pan. Add cumin seeds, asafoetida, and dried red chilies. 3. When the seeds splutter, add the chopped onion and garlic. Sauté until golden brown. 4. Pour this hot tempering over the cooked dal. Mix well and simmer for 2 minutes. Garnish with fresh coriander."
  },
  {
    "meal_id": 57,
    "meal_name": "Mix Veg Curry",
    "ingredients": [
      "2 cups mixed vegetables (potato, carrot, peas, beans, cauliflower)",
      "1 large onion, chopped",
      "2 tomatoes, pureed",
      "1 tbsp ginger-garlic paste",
      "1/4 cup coconut milk or cream (optional)",
      "1 tsp red chili powder",
      "1 tsp coriander powder",
      "1/2 tsp garam masala"
    ],
    "recipe": "1. Heat oil, sauté onions until golden. Add ginger-garlic paste. 2. Add tomato puree and powdered spices. Cook until oil separates from the masala. 3. Add the mixed vegetables and 1 cup of water. Season with salt. 4. Cover and cook until the vegetables are tender. 5. Stir in coconut milk or cream for a richer gravy. Finish with garam masala."
  },
  {
    "meal_id": 58,
    "meal_name": "Chana Masala",
    "ingredients": [
      "2 cups boiled chickpeas",
      "2 large onions, finely chopped",
      "3 tomatoes, pureed",
      "1 tbsp ginger-garlic paste",
      "2 tbsp chana masala powder",
      "1 tsp amchur (dry mango powder)",
      "1 tsp red chili powder",
      "3 tbsp oil"
    ],
    "recipe": "1. Heat oil, sauté onions until deep golden brown. 2. Add ginger-garlic paste and cook. Add tomato puree, chana masala powder, chili powder, and amchur. Cook until the masala is thick and aromatic. 3. Add the boiled chickpeas along with some of the water they were boiled in. Mash some of the chickpeas to thicken the gravy. 4. Simmer for 15-20 minutes, allowing the flavors to meld. Garnish with coriander and onion rings."
  },
  {
    "meal_id": 59,
    "meal_name": "Rajma Masala",
    "ingredients": [
      "2 cups boiled red kidney beans (rajma)",
      "1 large onion, finely chopped",
      "3 tomatoes, pureed",
      "1 tbsp ginger-garlic paste",
      "1 tsp red chili powder",
      "1 tsp coriander powder",
      "1/2 tsp garam masala",
      "3 tbsp oil"
    ],
    "recipe": "1. Heat oil, sauté onions until golden brown. Add ginger-garlic paste. 2. Add tomato puree and all powdered spices. Cook until the masala releases oil. 3. Add the boiled rajma along with its cooking water. Mash some beans to thicken the gravy. 4. Season with salt and simmer on low heat for at least 20-30 minutes for the flavors to deepen. Serve hot with rice."
  },
  {
    "meal_id": 60,
    "meal_name": "Soya Chaap Masala",
    "ingredients": [
      "250g soya chaap sticks",
      "For Marinade: 1/2 cup yogurt, 1 tsp ginger-garlic paste, 1 tsp tandoori masala",
      "For Gravy: 2 onions (paste), 2 tomatoes (pureed), 1/4 cup cashew paste, 1/4 cup cream"
    ],
    "recipe": "1. Boil the soya chaap sticks to soften them. Remove from sticks and cut into pieces. Marinate for 30 minutes. 2. Pan-fry or deep-fry the marinated chaap pieces until golden. 3. Prepare a gravy similar to Paneer Butter Masala, using onion paste, tomato puree, and cashew paste. 4. Add the fried soya chaap pieces to the gravy and simmer for 10 minutes. 5. Finish with cream and kasuri methi."
  },
  {
    "meal_id": 61,
    "meal_name": "Chicken Curry",
    "ingredients": [
      "500g chicken, on the bone",
      "2 large onions, finely chopped",
      "2 large tomatoes, pureed",
      "1 tbsp ginger-garlic paste",
      "1/2 cup yogurt, whisked",
      "1 tsp red chili powder",
      "1 tsp coriander powder",
      "1/2 tsp turmeric powder",
      "1/2 tsp garam masala"
    ],
    "recipe": "1. Heat oil, add whole spices (optional). Sauté onions until deep golden brown. 2. Add ginger-garlic paste. Add the chicken pieces and brown them on high heat. 3. Add the powdered spices and cook for a minute. 4. Lower the heat and add the whisked yogurt, stirring continuously. 5. Add the tomato puree and salt. Cook until oil separates. 6. Add 1.5 cups of hot water, cover, and simmer for 25-30 minutes until chicken is tender. Finish with garam masala."
  },
  {
    "meal_id": 62,
    "meal_name": "Egg Curry",
    "ingredients": [
      "6 hard-boiled eggs, peeled",
      "2 medium onions, finely chopped",
      "2 tomatoes, pureed",
      "1 tbsp ginger-garlic paste",
      "1 tsp red chili powder",
      "1 tsp coriander powder",
      "1/2 tsp turmeric",
      "1/2 tsp garam masala"
    ],
    "recipe": "1. Make small slits on the boiled eggs. Lightly fry them in a little oil until they have a pale golden skin. Set aside. 2. In the same pan, prepare a gravy by sautéing onions, adding ginger-garlic paste, tomato puree, and powdered spices. 3. Cook the masala until oil separates. Add 1.5 cups of water and bring to a simmer. 4. Add the fried eggs to the gravy and simmer for 10 minutes. Finish with garam masala."
  },
  {
    "meal_id": 63,
    "meal_name": "Fish Tikka Masala",
    "ingredients": [
      "500g fish tikka pieces (firm white fish)",
      "For Gravy: 2 onions (chopped), 2 tomatoes (pureed), 1/4 cup cashew paste, 1 tbsp ginger-garlic paste, 1/4 cup cream",
      "Spices: red chili powder, coriander powder, garam masala"
    ],
    "recipe": "1. Prepare fish tikka by marinating fish chunks in a yogurt-spice mix and grilling them. 2. Prepare a creamy, tomato-based gravy similar to Chicken Tikka Masala. 3. Gently add the cooked fish tikka pieces to the simmering gravy. 4. Cook for just 5-7 minutes, being careful not to break the fish. Finish with cream and coriander."
  },
  {
    "meal_id": 64,
    "meal_name": "Prawn Masala",
    "ingredients": [
      "500g prawns, cleaned",
      "2 large onions, finely chopped",
      "2 tomatoes, finely chopped",
      "1 tbsp ginger-garlic paste",
      "1/2 cup coconut milk",
      "1 tsp red chili powder",
      "1 tsp coriander powder",
      "1/2 tsp turmeric"
    ],
    "recipe": "1. Heat oil, sauté onions until golden brown. Add ginger-garlic paste. 2. Add the chopped tomatoes and cook until soft. Add all powdered spices and cook the masala well. 3. Add the prawns and cook for 3-4 minutes until they turn pink. 4. Pour in the coconut milk, season with salt, and bring to a gentle simmer. Cook for another 2-3 minutes. Do not overcook the prawns."
  },
  {
    "meal_id": 65,
    "meal_name": "Kadai Chicken",
    "ingredients": [
      "500g chicken, on the bone",
      "1 large onion, cubed",
      "1 large bell pepper, cubed",
      "Coarsely ground Kadai Masala (coriander seeds, red chilies, cumin)",
      "2 tomatoes, pureed",
      "1 tbsp ginger-garlic paste"
    ],
    "recipe": "1. Heat oil, sauté the cubed onion and bell pepper until slightly charred. Remove and set aside. 2. In the same pan, brown the chicken pieces. Add ginger-garlic paste. 3. Add the tomato puree and the ground kadai masala. Cook until oil separates. 4. Add a little water, cover, and cook until the chicken is tender. 5. Add back the sautéed onion and bell pepper. Mix and cook for 5 more minutes."
  },
  {
    "meal_id": 66,
    "meal_name": "Bhuna Gosht",
    "ingredients": [
      "500g mutton",
      "2 large onions, thinly sliced",
      "1/2 cup yogurt",
      "2 tbsp ginger-garlic paste",
      "Spices: red chili powder, coriander powder, turmeric",
      "Whole spices: bay leaf, cloves, cinnamon"
    ],
    "recipe": "1. Heat oil, add whole spices. Fry the sliced onions until deep brown. 2. Add the mutton pieces and sear on high heat. Add ginger-garlic paste. 3. Add the powdered spices and yogurt. Cook on medium heat, stirring continuously, until the oil separates. This is the 'bhuna' process. 4. Add a splash of water, cover, and cook on low heat until the mutton is extremely tender and the masala is thick and clinging to the meat."
  },
  {
    "meal_id": 67,
    "meal_name": "Dhansak",
    "ingredients": [
      "500g mutton",
      "1 cup mixed lentils (toor, masoor, chana), soaked",
      "1 cup chopped vegetables (pumpkin, eggplant, tomato)",
      "2 tbsp Dhansak masala",
      "1 tbsp tamarind pulp",
      "1 tbsp ginger-garlic paste"
    ],
    "recipe": "1. Pressure cook the mutton, lentils, and vegetables together with ginger-garlic paste and salt until everything is very soft. 2. Blend the mixture to a thick, porridge-like consistency. 3. In a separate pan, prepare a tempering with oil, cumin, and onions. Add the Dhansak masala and cook. 4. Pour the blended dal-meat mixture into the tempering. Add tamarind pulp and jaggery/sugar to balance the flavors. Simmer for 15 minutes. Serve with caramelized brown rice."
  },
  {
    "meal_id": 68,
    "meal_name": "Butter Garlic Prawns",
    "ingredients": [
      "500g large prawns, deveined",
      "4 tbsp butter",
      "8-10 cloves garlic, minced",
      "1/2 tsp red chili flakes",
      "Juice of 1 lemon",
      "2 tbsp chopped fresh parsley",
      "Salt and black pepper to taste"
    ],
    "recipe": "1. Melt butter in a pan over medium heat. Add the minced garlic and chili flakes and sauté for a minute until aromatic. 2. Add the prawns to the pan in a single layer. Season with salt and pepper. 3. Cook for 2-3 minutes on each side until the prawns are pink and cooked through. 4. Turn off the heat, stir in the lemon juice and fresh parsley. Serve immediately."
  },
  {
    "meal_id": 69,
    "meal_name": "Chicken Do Pyaza",
    "ingredients": [
      "500g chicken",
      "2 large onions (1 finely chopped, 1 cut into petals)",
      "2 tomatoes, pureed",
      "1/2 cup yogurt",
      "1 tbsp ginger-garlic paste",
      "Spices: red chili powder, coriander powder, turmeric"
    ],
    "recipe": "1. Heat oil, sauté the finely chopped onion until golden brown. Add ginger-garlic paste. 2. Add the chicken and brown it. Add powdered spices and yogurt. Cook until oil separates. 3. Add tomato puree and cook. Add water and simmer until chicken is tender. 4. In a separate pan, sauté the onion petals until translucent. 5. Add the sautéed onion petals to the chicken curry and cook for another 5 minutes."
  },
  {
    "meal_id": 70,
    "meal_name": "Mutton Biryani",
    "ingredients": [
      "500g mutton",
      "2 cups basmati rice",
      "Marinade: 1 cup yogurt, fried onions, mint, coriander, ginger-garlic paste, biryani masala",
      "Saffron milk, ghee, whole spices"
    ],
    "recipe": "1. Marinate mutton for at least 6 hours or overnight. 2. Par-boil rice until 70% cooked. 3. Layer the marinated mutton and par-boiled rice in a heavy-bottomed pot. 4. Top with saffron milk, ghee, and more fried onions. 5. Seal the pot and cook on low heat (dum) for 45-60 minutes until the mutton is tender and the rice is fragrant and fully cooked."
  },
  {
    "meal_id": 71,
    "meal_name": "Chicken Chettinad",
    "ingredients": [
      "500g chicken",
      "For Chettinad Masala: dried red chilies, coriander seeds, cumin, fennel, peppercorns, star anise, grated coconut",
      "1 large onion, chopped",
      "2 tomatoes, chopped",
      "1 tbsp ginger-garlic paste",
      "Curry leaves"
    ],
    "recipe": "1. Dry roast all the Chettinad masala ingredients (including coconut) until aromatic and grind to a paste with a little water. 2. Heat oil, add curry leaves. Sauté onion until golden. Add ginger-garlic paste. 3. Add tomatoes and cook until soft. Add the ground Chettinad masala paste and cook until oil separates. 4. Add the chicken pieces and coat well with the masala. Add water, cover, and cook until the chicken is tender."
  },
  {
    "meal_id": 72,
    "meal_name": "Dum Aloo Kashmiri",
    "ingredients": [
      "500g baby potatoes",
      "1 cup yogurt, whisked",
      "1 tsp Kashmiri red chili powder",
      "1 tsp fennel powder",
      "1/2 tsp dry ginger powder",
      "A pinch of asafoetida (hing)",
      "Whole spices: cloves, cardamom",
      "Mustard oil for frying"
    ],
    "recipe": "1. Boil, peel, and prick the baby potatoes. Deep fry them in mustard oil until golden brown and crisp on the outside. 2. In a pan, heat some oil, add asafoetida and whole spices. 3. Lower the heat and add the whisked yogurt, stirring continuously. 4. Add the red chili powder, fennel powder, and ginger powder. Cook until the gravy thickens. 5. Add the fried potatoes and 1 cup of water. Simmer for 15-20 minutes until the gravy is absorbed by the potatoes."
  },
  {
    "meal_id": 73,
    "meal_name": "Bharwan Bhindi",
    "ingredients": [
      "500g okra (bhindi)",
      "For Stuffing: 1/2 cup roasted gram flour, 1 tsp red chili powder, 1 tsp coriander powder, 1/2 tsp turmeric, 1 tsp amchur (dry mango powder), salt",
      "Oil for shallow frying"
    ],
    "recipe": "1. Wash and dry the okra. Slit each one lengthwise without cutting through. 2. Mix all the stuffing ingredients together. Add a teaspoon of oil to make it a crumbly mixture. 3. Carefully stuff this masala mixture into the slit okra. 4. Heat oil in a wide pan. Arrange the stuffed okra in a single layer. 5. Cook on low heat, covered, for 15-20 minutes, turning them carefully in between, until the okra is tender and cooked."
  },
  {
    "meal_id": 74,
    "meal_name": "Sarson Ka Saag",
    "ingredients": [
      "1 kg mustard greens (sarson)",
      "250g spinach (palak)",
      "250g bathua (chenopodium)",
      "1/4 cup maize flour (makki ka atta)",
      "2 onions, chopped",
      "1 tbsp ginger-garlic paste",
      "Ghee for tempering"
    ],
    "recipe": "1. Thoroughly wash and chop all the greens. Pressure cook them with a little water and salt until very soft. 2. Blend the cooked greens to a coarse paste. Add the maize flour and mix well to avoid lumps. 3. Cook this mixture on low heat for 20-30 minutes until it thickens. 4. For the tempering (tadka), heat ghee, sauté onions until golden, add ginger-garlic paste. Pour this over the saag. Serve hot with a dollop of white butter and Makki di Roti."
  },
  {
    "meal_id": 75,
    "meal_name": "Dal Bukhara",
    "ingredients": [
      "1 cup whole black lentils (urad dal)",
      "1/2 cup tomato puree",
      "1 tbsp ginger-garlic paste",
      "1/4 cup cream",
      "3 tbsp butter",
      "1 tsp red chili powder"
    ],
    "recipe": "1. Soak the lentils overnight. Pressure cook until very soft. 2. In a heavy-bottomed pan, combine the cooked dal, tomato puree, ginger-garlic paste, chili powder, butter, and salt. 3. Bring to a simmer and cook on very low heat for at least 2-3 hours, stirring occasionally, until the dal is creamy and thick. The slow cooking is key. 4. Before serving, stir in the cream. Garnish with more butter."
  },
  {
    "meal_id": 76,
    "meal_name": "Veg Kolhapuri",
    "ingredients": [
      "2 cups mixed vegetables",
      "For Kolhapuri Masala: dried red chilies, coriander seeds, sesame seeds, dried coconut, peppercorns, cloves",
      "1 onion, chopped",
      "1 tomato, pureed"
    ],
    "recipe": "1. Dry roast all the Kolhapuri masala ingredients and grind to a fine powder. 2. Boil the mixed vegetables until tender-crisp. 3. Heat oil, sauté onion. Add tomato puree and the ground Kolhapuri masala. Cook until aromatic. 4. Add the boiled vegetables and a little water. Simmer for 10 minutes. The gravy should be thick and spicy."
  },
  {
    "meal_id": 77,
    "meal_name": "Shahi Paneer",
    "ingredients": [
      "250g paneer, cubed",
      "For Gravy: 2 onions (boiled and pureed), 1/2 cup cashew paste, 1/2 cup yogurt, 1/4 cup cream",
      "Spices: white pepper powder, cardamom powder, a pinch of saffron"
    ],
    "recipe": "1. Heat ghee, add the onion puree and cook without browning. 2. Add the cashew paste and cook for a few minutes. 3. Whisk the yogurt and add it to the pan, stirring continuously. 4. Add water to get the desired consistency. Season with salt, white pepper, and cardamom powder. 5. Add the paneer cubes and saffron. Simmer gently for 5 minutes. 6. Finish with cream."
  },
  {
    "meal_id": 78,
    "meal_name": "Nalli Nihari",
    "ingredients": [
      "500g mutton shanks (nalli)",
      "2 large onions, sliced and fried crisp (birista)",
      "2 tbsp ginger-garlic paste",
      "2 tbsp Nihari masala",
      "1/2 cup yogurt",
      "2 tbsp wheat flour (atta), made into a slurry"
    ],
    "recipe": "1. Heat ghee, add the mutton shanks and brown them. Add ginger-garlic paste and Nihari masala. 2. Add the yogurt and half of the fried onions. Cook for 10 minutes. 3. Add 4-5 cups of hot water and salt. Pressure cook for 45-60 minutes until the meat is falling off the bone. 4. Open the cooker, let it simmer. Gradually add the wheat flour slurry, stirring to avoid lumps, to thicken the gravy. 5. Simmer for 15 minutes. Serve hot, garnished with the remaining fried onions, ginger juliennes, and lemon."
  },
  {
    "meal_id": 79,
    "meal_name": "Raan Musallam",
    "ingredients": [
      "1 whole leg of mutton (raan), about 1-1.5 kg",
      "Marinade: 1 cup yogurt, 3 tbsp ginger-garlic paste, juice of 2 lemons, red chili powder, turmeric, garam masala, paste of almonds and cashews"
    ],
    "recipe": "1. Clean the leg of mutton and make deep incisions all over. 2. Apply a preliminary marinade of ginger-garlic paste, lemon juice, and salt. Let it rest for 1 hour. 3. Prepare the second marinade with yogurt, nut paste, and all the spices. Coat the leg of mutton thoroughly, rubbing the marinade into the incisions. 4. Refrigerate and marinate for at least 8 hours, preferably overnight. 5. Slow-roast in a preheated oven at 180°C (350°F) for 2-3 hours, basting with ghee, until the meat is completely tender and cooked through."
  },
  {
    "meal_id": 80,
    "meal_name": "Amritsari Kulcha with Chole",
    "ingredients": [
      "For Kulcha: 2 cups all-purpose flour, yogurt, baking soda",
      "For Stuffing: 3-4 boiled potatoes (mashed), chopped onion, pomegranate seeds, spices",
      "Chole (see Chana Masala recipe)"
    ],
    "recipe": "1. Prepare a soft dough for the kulcha and let it rest. 2. Prepare the potato stuffing by mixing all the ingredients. 3. Take a ball of dough, flatten it, place a portion of the stuffing in the center, and seal it. 4. Roll it out into a kulcha. Cook in a tandoor or on a tawa until crisp and golden. 5. Brush with a generous amount of butter and serve immediately with spicy chole."
  },
  {
    "meal_id": 81,
    "meal_name": "Galouti Kebab",
    "ingredients": [
      "500g very fine minced mutton (passed through the grinder 3 times)",
      "1/4 cup raw papaya paste (as tenderizer)",
      "1/4 cup roasted gram flour",
      "2 tbsp fried onion paste",
      "1 tsp ginger-garlic paste",
      "A unique blend of over 100 spices (potli ka masala), including rose water, saffron, and cardamom"
    ],
    "recipe": "1. Mix the fine minced meat with the raw papaya paste and let it rest for 4-5 hours to tenderize. 2. Add the fried onion paste, ginger-garlic paste, roasted gram flour, and the secret spice blend to the meat. 3. Mix everything thoroughly until it forms a smooth, pasty dough. The mixture will be very soft. 4. Shape into small patties and shallow fry on a tawa with ghee on low heat until both sides are dark brown and cooked. Handle very gently as they are extremely delicate."
  },
  {
    "meal_id": 82,
    "meal_name": "Kakori Kebab",
    "ingredients": [
      "500g very fine mutton mince",
      "1/2 cup khoya (milk solids)",
      "1 tbsp raw papaya paste",
      "1 tbsp ginger-garlic paste",
      "A specific blend of spices including black cardamom, cloves, and rose petals",
      "Ghee for basting"
    ],
    "recipe": "1. Marinate the fine mince with papaya paste for 2-3 hours. 2. Add khoya, ginger-garlic paste, and the special spice blend to the meat. Mix and grind again to a very smooth paste. 3. Apply the mixture onto skewers in a long, thin shape. 4. Grill carefully on a charcoal grill, basting with ghee, until cooked and slightly browned. They are known for their soft, melt-in-the-mouth texture."
  },
  {
    "meal_id": 83,
    "meal_name": "Chapli Kebab",
    "ingredients": [
      "500g coarse minced meat (mutton or beef)",
      "1 large onion, finely chopped",
      "1 large tomato, finely chopped",
      "2 tbsp pomegranate seeds (anardana), coarsely crushed",
      "1 egg",
      "2 tbsp maize flour (makki ka atta)",
      "Spices: coriander powder, red chili flakes, garam masala"
    ],
    "recipe": "1. In a large bowl, mix the minced meat with all the other ingredients. Knead well as if you are kneading dough. This helps in binding. 2. Let the mixture rest for 30 minutes. 3. Wet your hands and shape the mixture into large, flat, irregular-shaped patties. 4. Shallow fry in hot oil or animal fat on a large flat pan or tawa until both sides are dark brown and crisp."
  },
  {
    "meal_id": 84,
    "meal_name": "Boti Kebab",
    "ingredients": [
      "500g boneless mutton cubes",
      "Marinade: 1/2 cup yogurt, 2 tbsp raw papaya paste, 1 tbsp ginger-garlic paste, red chili powder, garam masala, salt",
      "Ghee for basting"
    ],
    "recipe": "1. Marinate the mutton cubes in the mixture of yogurt, papaya paste, ginger-garlic paste, and all the spices. 2. Let it marinate overnight in the refrigerator for the meat to become tender. 3. Thread the mutton pieces onto skewers. 4. Grill over charcoal or in an oven, turning occasionally and basting with ghee, until the mutton is tender, cooked through, and has a nice char on the outside."
  },
  {
    "meal_id": 85,
    "meal_name": "Malabar Parotta with Chicken Curry",
    "ingredients": [
      "For Parotta: 2 cups all-purpose flour, 1 egg, 1 tbsp sugar, salt, milk/water, oil",
      "For Chicken Curry: 500g chicken, 1 cup coconut milk, onion, tomato, ginger-garlic, curry leaves, spices (turmeric, chili, coriander)"
    ],
    "recipe": "1. For Parotta: Knead a very soft, elastic dough. Let it rest. Roll out very thin, create layers by pleating and coiling, then roll again and cook on a tawa with oil. 2. For Curry: Prepare a basic chicken curry with a base of onion, tomato, and spices. Finish by adding thick coconut milk for the authentic Malabar flavor. 3. Serve the flaky, hot parottas with the fragrant chicken curry."
  },
  {
    "meal_id": 86,
    "meal_name": "Appam with Stew",
    "ingredients": [
      "For Appam: 1 cup raw rice (soaked), 1/4 cup cooked rice, 1/2 cup grated coconut, 1 tsp yeast, 1 tbsp sugar",
      "For Stew: 2 cups mixed vegetables, 1.5 cups thin coconut milk, 1/2 cup thick coconut milk, whole spices (cinnamon, cloves, cardamom)"
    ],
    "recipe": "1. For Appam: Grind soaked rice, cooked rice, and coconut to a smooth batter. Add yeast and sugar, and let it ferment overnight. 2. For Stew: Cook vegetables in thin coconut milk with whole spices until tender. Add salt. Finish with thick coconut milk, but do not boil after adding it. 3. To make appams, pour a ladleful of batter into a special curved pan (appachatti), swirl it around to create a lacey edge, cover and cook until the center is soft and spongy."
  },
  {
    "meal_id": 87,
    "meal_name": "Pesarattu with Ginger Chutney",
    "ingredients": [
      "For Pesarattu: 1 cup whole green moong dal (soaked overnight), 1-inch ginger, 2 green chilies",
      "For Chutney: 1/4 cup chopped ginger, small ball of tamarind, 4-5 dried red chilies, jaggery, salt"
    ],
    "recipe": "1. For Pesarattu: Grind the soaked moong dal with ginger and green chilies to a smooth batter. Add salt. The batter does not need fermentation. 2. For Chutney: Grind all the chutney ingredients together to a smooth paste. 3. Make thin crepes (like dosas) from the batter on a hot tawa. Optionally, sprinkle with chopped onions. 4. Serve the hot, crispy pesarattu with the spicy and tangy ginger chutney."
  },
  {
    "meal_id": 88,
    "meal_name": "Masala Dosa",
    "ingredients": [
      "For Dosa Batter: 2 cups rice, 1/2 cup urad dal (soaked and fermented)",
      "For Masala Filling: 4 large potatoes (boiled, mashed), 1 onion (sliced), mustard seeds, curry leaves, turmeric"
    ],
    "recipe": "1. Prepare the dosa batter by soaking rice and dal, grinding them, and letting the batter ferment overnight. 2. For the filling, prepare a tempering of mustard seeds and curry leaves. Sauté onions. Add turmeric and the mashed potatoes. Mix well. 3. Heat a tawa, spread a thin layer of the dosa batter to make a crepe. Drizzle oil. 4. When the dosa is crisp and golden, place a spoonful of the potato masala in the center and fold the dosa. Serve with sambar and coconut chutney."
  },
  {
    "meal_id": 89,
    "meal_name": "Idli Sambar",
    "ingredients": [
      "For Idli: 2 cups idli rice, 1 cup urad dal (soaked, ground, and fermented batter)",
      "For Sambar: 1 cup toor dal, 1 cup mixed vegetables (drumstick, pumpkin, carrots), small ball of tamarind, 2 tbsp sambar powder"
    ],
    "recipe": "1. For Idli: Grease idli molds and pour the fermented batter into them. Steam for 10-12 minutes until a toothpick inserted comes out clean. 2. For Sambar: Pressure cook the toor dal. In a pot, cook the vegetables with tamarind water and sambar powder. Add the cooked dal and simmer. Prepare a tempering of mustard seeds, curry leaves, and asafoetida and add it to the sambar. 3. Serve the soft, fluffy idlis with hot sambar."
  },
  {
    "meal_id": 90,
    "meal_name": "Vada Pav",
    "ingredients": [
      "For Vada: 4 potatoes (boiled, mashed), ginger-garlic paste, mustard seeds, turmeric",
      "For Batter: 1 cup gram flour (besan)",
      "8 pav buns",
      "Dry garlic chutney, green chutney, tamarind chutney"
    ],
    "recipe": "1. Prepare the potato filling for the vada by making a tempering and mixing it with the mashed potatoes. Shape into balls. 2. Make a thick batter with gram flour. Dip the potato balls in the batter and deep fry until golden. 3. Slit a pav bun, apply the different chutneys on the inside. Place a hot vada in the center, press gently, and serve."
  },
  {
    "meal_id": 91,
    "meal_name": "Pav Bhaji",
    "ingredients": [
      "For Bhaji: 4 cups mixed vegetables (potatoes, cauliflower, peas, carrots), 2 onions (chopped), 3 tomatoes (chopped), 2 tbsp pav bhaji masala, 1 tbsp ginger-garlic paste",
      "12 pav buns",
      "A large dollop of butter"
    ],
    "recipe": "1. Boil and mash all the vegetables. 2. In a large pan, melt butter. Sauté onions until translucent. Add ginger-garlic paste. Add chopped tomatoes and cook until soft. 3. Add the pav bhaji masala and cook. 4. Add the mashed vegetables, salt, and some water. Mash everything together in the pan and simmer for 15-20 minutes. 5. Serve the hot bhaji garnished with butter, chopped onions, and coriander. Serve with pav buns that have been toasted with butter."
  },
  {
    "meal_id": 92,
    "meal_name": "Dabeli",
    "ingredients": [
      "For Stuffing: 4 potatoes (boiled, mashed), 3 tbsp dabeli masala, tamarind chutney",
      "8 pav buns",
      "For Garnish: roasted peanuts, pomegranate seeds, sev (fine gram flour noodles)"
    ],
    "recipe": "1. Prepare the stuffing by mixing mashed potatoes with dabeli masala and tamarind chutney in a pan. 2. Slit the pav buns. Apply tamarind chutney on one side and garlic chutney on the other. 3. Fill the pav with the potato stuffing. 4. Garnish the sides of the dabeli by rolling it in sev, peanuts, and pomegranate seeds. Toast the dabeli on a tawa with butter before serving."
  },
  {
    "meal_id": 93,
    "meal_name": "Khandvi",
    "ingredients": [
      "1 cup gram flour (besan)",
      "1 cup yogurt",
      "2 cups water",
      "1 tsp ginger-green chili paste",
      "1/2 tsp turmeric",
      "For Tempering: mustard seeds, curry leaves, sesame seeds, grated coconut"
    ],
    "recipe": "1. Whisk gram flour, yogurt, water, ginger-chili paste, turmeric, and salt to a smooth, lump-free batter. 2. Cook this batter in a pan on low heat, stirring continuously, until it becomes very thick. 3. Quickly spread this hot mixture very thinly onto greased plates or a clean countertop. 4. Let it cool for 5-10 minutes. Cut into wide strips and roll them up tightly. 5. Prepare a tempering and pour it over the rolls. Garnish with coconut."
  },
  {
    "meal_id": 94,
    "meal_name": "Dhokla",
    "ingredients": [
      "1 cup gram flour (besan)",
      "1/2 cup yogurt",
      "1 tsp Eno fruit salt or baking soda",
      "1 tsp ginger-green chili paste",
      "1/2 tsp turmeric",
      "For Tempering: oil, mustard seeds, green chilies, curry leaves, sugar, water"
    ],
    "recipe": "1. Make a thick batter with besan, yogurt, water, ginger-chili paste, turmeric, and salt. Let it rest for 20 minutes. 2. Just before steaming, add the Eno fruit salt and mix gently. 3. Pour the batter into a greased steaming tin and steam for 15-20 minutes. 4. Let it cool slightly and cut into squares. 5. Prepare a tempering with oil, mustard seeds, chilies, and curry leaves. Add water and sugar and let it boil. Pour this syrup over the dhoklas."
  },
  {
    "meal_id": 95,
    "meal_name": "Fafda Jalebi",
    "ingredients": [
      "For Fafda: 2 cups gram flour, ajwain, papad khar (alkali), oil",
      "Jalebi (see recipe above)",
      "A side of raw papaya chutney (sambharo)"
    ],
    "recipe": "1. For Fafda: Knead a tight dough with gram flour and other ingredients. Take a small portion, place it on a wooden board, and drag it with the base of your palm to create a long, thin strip. 2. Deep fry these strips until they are crisp. 3. Serve the crispy, salty fafda with sweet, syrupy jalebis and a tangy papaya chutney for a classic Gujarati breakfast experience."
  },
  {
    "meal_id": 96,
    "meal_name": "Poha",
    "ingredients": [
      "2 cups thick flattened rice (poha)",
      "1 large onion, chopped",
      "1/4 cup peanuts",
      "1 tsp mustard seeds",
      "8-10 curry leaves",
      "1/2 tsp turmeric",
      "1 tbsp sugar",
      "Juice of 1 lemon"
    ],
    "recipe": "1. Rinse the poha in a strainer until it softens, then let it drain. 2. Heat oil, fry the peanuts until crisp and set them aside. 3. In the same oil, add mustard seeds and curry leaves. Add the chopped onion and sauté until translucent. 4. Add turmeric, the drained poha, salt, and sugar. Mix gently. 5. Cover and cook on low heat for 5 minutes. 6. Turn off the heat, add lemon juice, and garnish with the fried peanuts and fresh coriander."
  },
  {
    "meal_id": 97,
    "meal_name": "Upma",
    "ingredients": [
      "1 cup semolina (rava/suji)",
      "1 medium onion, chopped",
      "1 tsp mustard seeds",
      "1 tsp urad dal",
      "8-10 curry leaves",
      "1/4 cup mixed vegetables (optional)",
      "2.5 cups hot water"
    ],
    "recipe": "1. Dry roast the semolina in a pan until it's aromatic and lightly colored. Set aside. 2. Heat oil, add mustard seeds, urad dal, and curry leaves. 3. Add the chopped onion and sauté until soft. Add vegetables if using. 4. Pour in the hot water and bring to a rolling boil. Add salt. 5. Lower the heat and slowly add the roasted semolina, stirring continuously to prevent lumps. 6. Cover and cook on low heat for 5-7 minutes until the upma is thick and cooked through."
  },
  {
    "meal_id": 98,
    "meal_name": "Sabudana Khichdi",
    "ingredients": [
      "1 cup sago (sabudana), soaked for 4-5 hours and drained",
      "1/2 cup roasted peanuts, coarsely crushed",
      "2 medium potatoes, boiled and cubed",
      "2 green chilies, chopped",
      "1 tsp cumin seeds",
      "Juice of 1 lemon",
      "2 tbsp ghee"
    ],
    "recipe": "1. Ensure the soaked sabudana is dry to the touch and the pearls are separate. Mix it with the crushed peanuts, salt, and a little sugar. 2. Heat ghee, add cumin seeds and green chilies. 3. Add the boiled potato cubes and sauté for a minute. 4. Add the sabudana-peanut mixture and cook on medium heat, stirring gently, for 5-7 minutes until the sabudana pearls turn translucent. 5. Turn off the heat and stir in the lemon juice."
  },
  {
    "meal_id": 99,
    "meal_name": "Thepla",
    "ingredients": [
      "1 cup whole wheat flour",
      "1/2 cup gram flour (besan)",
      "1 cup finely chopped fenugreek leaves (methi)",
      "1/4 cup yogurt",
      "Spices: turmeric, red chili powder, asafoetida",
      "Oil for cooking"
    ],
    "recipe": "1. In a bowl, mix all the ingredients (except oil) together. 2. Add a little water if needed to knead a soft dough. 3. Divide the dough into small balls and roll them out into thin circles (rotis). 4. Cook on a hot tawa with a little oil on both sides until golden brown spots appear. They are soft and can be stored for a couple of days."
  },
  {
    "meal_id": 100,
    "meal_name": "Litti Chokha",
    "ingredients": [
      "For Litti: 2 cups whole wheat flour, 1 cup sattu (roasted gram flour) for stuffing, pickle masala, mustard oil",
      "For Chokha: 1 large eggplant, 2 large tomatoes, 4 potatoes (all roasted), chopped onion, garlic, green chilies, mustard oil"
    ],
    "recipe": "1. For Litti: Prepare a firm dough. For the stuffing, mix sattu with spices, pickle masala, and mustard oil. Stuff the dough balls with this mixture. Traditionally, these are roasted over a charcoal fire, but can also be baked in an oven. 2. For Chokha: Peel the roasted vegetables and mash them together. Mix in chopped onion, garlic, chilies, salt, and a generous amount of pungent mustard oil. 3. To serve, dip the hot littis in melted ghee and serve with the chokha."
  }
]
